[
    {
        "heading": "Aston Martin Joins EV Club:First One Out in 2025",
        "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/aston-martin-valhalla-101-1626200852.jpg?crop=1.00xw:1.00xh;0,0&resize=768:*",
        "date": "APR 22, 2022",
        "description": "For anyone who hasn't figured it out by now, the auto industry is having a moment. It seems every other day another automaker is parading its plans to transition to an entirely electric lineup by the end of the decade. Today it's Aston Martin's turn. To no one's surprise, the company is targeting 2030 as the expiration date of new models with internal-combustion engines. Of course, there's a chance it'll still build gas-burning special editions outside its core lineup. Besides that predictable announcement, though, Aston also says it'll launch its first electric model by 2025."

    },
    {
        "heading": "20,000th Lamborghini Huracán Rolls off the Line in Italy",
        "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/613793-1650643447.jpg?crop=1.00xw:0.847xh;0,0.153xh&resize=768:*",
        "date": "APR 22, 2022",
        "description": "For most of Lamborghini’s history, the Italian supercar marque managed to sell only a few hundred vehicles per year. But this changed when the Gallardo arrived in 2003—the junior V-10 supercar sold just over 14,000 units during a ten-year production run. This blew its predecessor, the V-8–powered Jalpa, out of the water, with only 410 Jalpas being sold between 1981 and 1988. But the Gallardo’s follow-up, the Huracán, has proved even more successful, and Lamborghini announced on Thursday that it has built the 20,000th example of the V-10–powered supercar that entered production in 2014."
    },
    {
        "heading": "1978 Cadillac Eldorado Biarritz Is Our Bring a Trailer Auction Pick of the Day",
        "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cadillac-eldorado-biarritzscreen-shot-2022-04-22-at-10-34-48-am-1650638198.png?crop=1xw:0.8359320129231633xh;center,top&resize=768:*",
        "date": "APR 22, 2022",
        "description": "You'd never guess this by walking through the traffic jam of classic European econoboxes in my garage, but I love American land yachts. My parents owned a series of bargelike General Motors cars when I was a kid—I remember my dad having to park his 1985 Oldsmobile Delta 88 diagonally to fit it in our garage—but none were as special as my step-grandfather's Cadillac Fleetwood Brougham. These massive Cadillacs have amassed a following in recent years, and there is what looks like an unusually well-kept 1978 Eldorado Biarritz currently live on Bring a Trailer – which, like Car and Driver, is part of Hearst Autos."
    },
    {
        "heading": "VW ID.3, Other Electric Cars Are Turning a Greek Island Green",
        "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/db2022al00183-large-1650548887.jpg?crop=1.00xw:0.966xh;0,0.0336xh&resize=768:*",
        "date": "APR 22, 2022",
        "description": "Volkswagen has delivered the first EVs to private customers on Astypalea as part of an experiment to transform the Greek island to an EV-only oasis. VW handed over the first examples of the ID.4 and VW e-up! hatchback to the island's residents, in addition to the new ID.3 hatch and the Seat MÓ eScooter 125."
    },
    {
        "heading": "Tested: 2022 Hyundai Ioniq 5 Charges to the Head of the Pack",
        "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2022-hyundai-ioniq-5-101-1650640889.jpg?crop=0.770xw:0.770xh;0.145xw,0.0638xh&resize=768:*",
        "date": "APR 22, 2022",
        "description": "We've officially reached the point where there's a decent selection of compelling five-passenger electric SUVs with a good amount of range. The Volkswagen ID.4, Ford Mustang Mach-E, and Tesla Model Y are becoming increasingly commonplace sights on American roads, and they've been recently joined by the Kia EV6 and its sharp-looking crosstown rival, the 2022 Hyundai Ioniq 5. Sharp turns out to be a particularly apt description of the Hyundai's distinctly creased styling, which features the mark of Zorro on its flanks, pixelated Minecraft detailing, and a chunky stance that benefits from an uncommonly long wheelbase, with stubby overhangs and sizable wheels pushed out nearly flush with the fenders. It's refreshing to see a unique take on the two-box crossover shape, but is there more to the Ioniq 5 than fresh-faced smart looks?"
    },
    {
        "heading": "Bugatti Reveals Two More Custom Chiron Sur Mesure Paint Jobs",
        "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bugatti-chiron-pur-sport-and-chiron-super-sport-vagues-de-lumiere-101-1650569079.jpg?crop=1.00xw:0.847xh;0,0.0255xh&resize=768:*",
        "date": "APR 21, 2022",
        "description": "Late last year Bugatti launched its own bespoke division, Sur Mesure, giving customers the opportunity to take customizing their 200-plus-mph missiles to the extreme. The first product of the Sur Mesure program was a baby-blue Chiron Pur Sport with red accents that honored Louis Chiron’s win at the 1931 French Grand Prix at the helm of a Bugatti Type 51. Now Bugatti has revealed two more of its Sur Mesure creations, another Chiron Pur Sport and a Chiron Super Sport hand-painted to mimic the way, as Bugatti puts it, 'the precisely designed body panels of the marque's hyper sports cars reflect light.'"
    },
    {
        "heading": "Tested: 2022 Lincoln Navigator Enters the Tech Era",
        "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2022-lincoln-navigator-black-label-104-1650569711.jpg?crop=0.986xw:0.987xh;0,0&resize=768:*",
        "date": "APR 21, 2022",
        "description": "The buzz around enormous body-on-frame luxury SUVs has reached a fever pitch. As lavish and accommodating as ever, these massive driving implements continue to advance in high-tech usefulness, with new and updated entries from Jeep and Lexus bolstering the segment's ranks. Someone at General Motors even had the idea to give the V treatment to the Cadillac Escalade, supercharged V-8 and all. To that lot we'll add the 2022 Lincoln Navigator, which has been polished with thoughtful touches and new hands-free driving capability as part of a mid-cycle refresh."
    },
    {
        "heading": "1969 Pontiac GTO Judge 4-Speed Is Our Bring a Trailer Auction Pick of the Day",
        "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/1969-pontiac-gto-judgescreen-shot-2022-04-21-at-1-32-54-pm-1650563443.png?crop=0.9898395721925134xw:1xh;center,top&resize=768:*",
        "date": "APR 21, 2022",
        "description": "As the proud owner of a 1968 GTO, I would be remiss not to single out this 1969 GTO Judge as a special car up for auction on Bring a Trailer—which, like Car and Driver, is part of Hearst Autos. The Judge is a special example of a muscle car from the late '60s. Just like the current owner of this 1969 GTO Judge, I also received mine by way of my father, who spent his summers in college working at the plant in Pontiac doing various jobs. One summer he worked in the iron foundry shoveling molding sand, one summer in the assembly line plant on the chassis line, and his last in the finishing plant adjusting headlights and prepping for shipping. It seems only fitting that he ended up with a GTO one day himself."
    },
    {
        "heading": "Tesla Robotaxi, Saying Production to Start by 2024",
        "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/in-an-aerial-view-tesla-cars-sit-parked-in-a-lot-at-the-news-photo-1650560535.jpg?crop=0.90829xw:1xh;center,top&resize=768:*",
        "date": "APR 21, 2022",
        "description": "Tesla's Elon Musk is back with another bold claim. Speaking during Tesla's first-quarter earnings call Wednesday night, CEO Musk claimed that Tesla will begin volume production of a 'robotaxi' by 2024, as reported by Automotive News. This vehicle, he said, will not be fitted with a steering wheel or pedals and will instead drive itself using Tesla's Full Self-Driving software, which is still undergoing beta testing."
    }
]
